src/DataProcessors/stdl_FindScheduleForDateByScheduleDateForGroupId/stdl_FindScheduleForDateByScheduleDateForGroupId.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>stdl_FindScheduleForDateByScheduleDateForGroupId</name>
</mdclass:DataProcessor>

src/Documents/РасписаниеНаДату/РасписаниеНаДату.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="67556fb8-e864-4231-8723-ea76290d615e">
  <name>РасписаниеНаДату</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="6fd1ce15-c032-43c2-8cf9-6dca79c53a4f">
    <name>ДатаРасписания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dde63ae7-29cf-42db-856a-b876ad93cf14">
    <name>РасписаниеЗвонков</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="dc7035b8-e6c1-468d-ac97-cf09aca28a5a">
    <name>Расписание</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="4cac6b1c-e4e9-4748-accb-372edb54de77">
      <name>УчебнаяГруппа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ae01e799-3570-4515-a953-c0e5831af752">
      <name>Подгруппа</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>1</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5dafb3f2-e15f-4911-99e6-6cbd02ca9922">
      <name>НомерПары</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="af6ee208-511a-488c-9990-c4d52b7b0386">
      <name>Дисциплина</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b95cb74a-cb80-4caa-8da1-574525953714">
      <name>Преподаватель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="43c40064-75b0-4d4c-9771-82ffb01d8139">
      <name>Аудитория</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="876a6bd1-d4af-475f-8ca0-58d6fcb124bf">
      <name>ВидНагрузки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/stdl_FindScheduleForDateByScheduleDateForGroupId/ObjectModule.bsl
// @strict-types
#Если Сервер Тогда

#Область ПрограммныйИнтерфейс

// Обработчик.
// 
// Параметры:
//	Контекст - Структура
// 
// Возвращаемое значение:
//	HTTPСервисОтвет
Функция Обработчик(Контекст) Экспорт
	Параметры = Параметры(оас_Контекст.Параметры(Контекст));
	
	УчебнаяГруппа = stdl_УчебныеГруппы.Получить(Новый УникальныйИдентификатор(Параметры.groupId));

	Если УчебнаяГруппа = Неопределено Тогда
		ТелоОтвета = stdl_Ошибки.ReferenceNotFound("Group with provided ID was not found.", "group");
		Возврат Ответ_404_application_json(ТелоОтвета);
	КонецЕсли;
	
	ДатаРасписания = ПрочитатьДатуJSON(Параметры.scheduleDate, ФорматДатыJSON.ISO);
	РасписаниеНаДату = stdl_РасписаниеНаДату.ПолучитьПоДатеРасписания(ДатаРасписания);
	
	Если РасписаниеНаДату = Неопределено Тогда
		ТелоОтвета = stdl_Ошибки.NotFound("ScheduleForDate for specified scheduleDate was not found.");
		Возврат Ответ_404_application_json(ТелоОтвета);
	КонецЕсли;
	
	ТелоОтвета = stdl_Модели.ScheduleForDate(РасписаниеНаДату);

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РасписаниеНаДатуРасписание.НомерСтроки,
		|	РасписаниеНаДатуРасписание.УчебнаяГруппа,
		|	РасписаниеНаДатуРасписание.Подгруппа,
		|	РасписаниеНаДатуРасписание.НомерПары,
		|	РасписаниеНаДатуРасписание.Дисциплина,
		|	РасписаниеНаДатуРасписание.Преподаватель,
		|	РасписаниеНаДатуРасписание.Аудитория,
		|	РасписаниеНаДатуРасписание.ВидНагрузки
		|ИЗ
		|	Документ.РасписаниеНаДату.Расписание КАК РасписаниеНаДатуРасписание
		|ГДЕ
		|	РасписаниеНаДатуРасписание.УчебнаяГруппа = &УчебнаяГруппа
		|	И РасписаниеНаДатуРасписание.Ссылка = &РасписаниеНаДату";
	
	Запрос.УстановитьПараметр("УчебнаяГруппа", УчебнаяГруппа);
	Запрос.УстановитьПараметр("РасписаниеНаДату", РасписаниеНаДату);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Schedule = Новый Массив; // Массив из см. stdl_Модели.Period
	
	ДисциплинаКНаименованию = stdl_СоответствияНаименований.ДисциплинаКНаименованию();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Period = stdl_Модели.Period(ВыборкаДетальныеЗаписи, ДисциплинаКНаименованию);
		//@skip-check property-return-type
		Period.Вставить("number", ВыборкаДетальныеЗаписи.НомерСтроки);
		Schedule.Добавить(Period);
	КонецЦикла;
	
	ТелоОтвета.Вставить("schedule", Schedule);
	
	Возврат Ответ_200_application_json(ТелоОтвета);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Параметры:
//	Параметры - Соответствие из КлючИЗначение -:
//		*Ключ - Произвольный
//		*Значение - Произвольный
// Возвращаемое значение:
//	Структура:
//		*groupId - Строка -
//		*scheduleDate - Строка -
Функция Параметры(Параметры)
	Результат = оас_Утилиты_КлиентСервер.ПолучитьСтруктуруИзСоответствия(Параметры);
	//@skip-check constructor-function-return-section
	Возврат Результат;
КонецФункции

#Область Ответы

// Параметры:
//	Тело - см. _Ответ_200_application_json_Определения.Ответ
//
// Возвращаемое значение:
//	HTTPСервисОтвет
Функция Ответ_200_application_json(Тело)
	КодОтвета = 200;
	Ответ = Новый HTTPСервисОтвет(КодОтвета);

	ТелоСтрокой = stdl_JSONКлиентСервер.Записать(Тело);
	Ответ.УстановитьТелоИзСтроки(ТелоСтрокой);

	Возврат Ответ;
КонецФункции
// Параметры:
//	Тело - см. _Ответ_404_application_json_Определения.Ответ_1, см. _Ответ_404_application_json_Определения.Ответ_2 -
//
// Возвращаемое значение:
//	HTTPСервисОтвет
Функция Ответ_404_application_json(Тело)
	КодОтвета = 404;
	Ответ = Новый HTTPСервисОтвет(КодОтвета);

	ТелоСтрокой = stdl_JSONКлиентСервер.Записать(Тело);
	Ответ.УстановитьТелоИзСтроки(ТелоСтрокой);

	Возврат Ответ;
КонецФункции


#КонецОбласти

#Область Определения

//@skip-check module-unused-method
// Возвращаемое значение:
//	Неопределено
Функция _Параметры_Определения()
	оас_Утилиты_КлиентСервер.ОшибкаТолькоДляОпределения();
	Возврат Неопределено;
КонецФункции

//@skip-check module-unused-method
// Параметры:
//	Ответ - Структура -:
//		*id - Строка -
//		*scheduleDate - Строка -
//		*periodScheduleId - Неопределено, Строка -
//		*schedule - Массив из см. _Ответ_200_application_json_Определения.Ответ_schedule_Элемент - -
//	Ответ_schedule_Элемент - Структура -:
//		*number - Число -
//		*groupId - Неопределено, Строка -
//		*subgroup - Неопределено, Число -
//		*workTypeId - Неопределено, Строка -
//		*periodNumber - Неопределено, Число -
//		*discipline - Неопределено, см. _Ответ_200_application_json_Определения.Ответ_schedule_Элемент_discipline -
//		*teacherId - Неопределено, Строка -
//		*classroomId - Неопределено, Строка -
//	Ответ_schedule_Элемент_discipline - Структура -:
//		*objectType - Строка - "discipline" | "practiceKind" | 
//		*objectId - Строка -
// Возвращаемое значение:
//	Неопределено
Функция _Ответ_200_application_json_Определения(Ответ, Ответ_schedule_Элемент, Ответ_schedule_Элемент_discipline)
	оас_Утилиты_КлиентСервер.ОшибкаТолькоДляОпределения();
	Возврат Неопределено;
КонецФункции
//@skip-check module-unused-method
// Параметры:
//	Ответ_2 - Структура:
//		*code - Строка - "NotFound"
//		*message - Строка -
//	Ответ_1 - Структура:
//		*code - Строка - "ReferenceNotFound"
//		*message - Строка -
//		*referenceType - Строка -
// Возвращаемое значение:
//	Неопределено
Функция _Ответ_404_application_json_Определения(Ответ_2, Ответ_1)
	оас_Утилиты_КлиентСервер.ОшибкаТолькоДляОпределения();
	Возврат Неопределено;
КонецФункции


#КонецОбласти

#КонецОбласти

#КонецЕсли
